Revit 2024 API
UnitTypeId.CurrencyPerSquareFoot Property
 Cost per square foot.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId CurrencyPerSquareFoot { get; }
Visual Basic
Public Shared ReadOnly Property CurrencyPerSquareFoot As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurrencyPerSquareFoot {
	ForgeTypeId^ get ();
}
See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace